CSI API ETABS v1
cPointObj.DeletePanelZone Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeletePanelZone(
	string Name,
	eItemType ItemType = eItemType.Objects
)
Function DeletePanelZone (
	Name As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.DeletePanelZone(Name,
	ItemType)
int DeletePanelZone(
	String^ Name,
	eItemType ItemType = eItemType::Objects
)
abstract DeletePanelZone :
        Name : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace